[
    {
        "company": "Microsoft",
        "job-title": "Software Engineer",
        "description": "The Dynamics 365 Business Central team within Microsoft is dedicated to revolutionizing business operations with a suite of comprehensive business management applications. As we navigate this era of digital transformation, we focus on delivering seamless experiences and empowering organizations with cutting-edge solutions.As Software Engineer within the Dynamics 365 Business Central team, you are actively involved in developing and maintain a highly scalable world class service tailored products to support diverse business functions that incorporate latest generative AI innovation across various business processes.Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.ResponsibilitiesDesign, code, test and deploy robust, scalable, and high-performance full-stack features for our web-based business management platform using C#, .NET, Azure and modern web frameworks Integrate generative AI and LLMs to build intelligent, next generation user experiences. This includes designing, implementing and refining prompts to ensure optimal performance relevance. Collaborate closely with program managers, UX designers and other engineers to translate complex business requirements into well-architected technical solutions. Actively participate in the team’s agile processes, contributing to planning, design sessions and sprint retrospectives. Enhance system quality by conducting code reviews, writing unit tests, and developing automation to ensure features are reliable and maintainable. Contribute to the health of our live service by monitoring performance, investigating and resolving production issues, and participating in an on-call rotation. QualificationsRequired qualifications:Bachelor's Degree in Computer Science, Engineering, or a related field, or equivalent industry experience. 1-3 yrs professional experience in full-stack software development, with a proven track record of shipping commercial software. Experience building and deploying scalable web applications using modern front-end frameworks like React, Angular etc. Hands on experience coding in an object-oriented language such as C#, TypeScript or similar. Strong problem-solving skills and the ability to work collaboratively in an agile team environment. Excelent written and verbal communication skils with the ability to clearly articulate complex technical topics and discuss requirements with stakeholders. Preferred QualificationsDemonstrated experience developing solutions on a cloud platform like Microsoft Azure, AWS or GAE Proficient with relational databases, SQL and data modeling Previous experience working with complex, data-intensive business applications Familiarity with LLM models, prompt engineering, and Agentic workflows. Familiar with CI/CD, automated testing, and modern DevOps practices.Microsoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.\n        \n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "level": "Not Applicable"
    },
    {
        "company": "PhonePe",
        "job-title": "Software Engineer (Backend 3-5yrs)",
        "description": "About PhonePe Limited:Headquartered in India, its flagship product, the PhonePe digital payments app, was launched in Aug 2016. As of April 2025, PhonePe has over 60 Crore (600 Million) registered users and a digital payments acceptance network spread across over 4 Crore (40+ million) merchants. PhonePe also processes over 33 Crore (330+ Million) transactions daily with an Annualized Total Payment Value (TPV) of over INR 150 lakh crore.PhonePe’s portfolio of businesses includes the distribution of financial products (Insurance, Lending, and Wealth) as well as new consumer tech businesses (Pincode - hyperlocal e-commerce and Indus AppStore Localized App Store for the Android ecosystem) in India, which are aligned with the company’s vision to offer every Indian an equal opportunity to accelerate their progress by unlocking the flow of money and access to services.Culture:At PhonePe, we go the extra mile to make sure you can bring your best self to work, Everyday!. And that starts with creating the right environment for you. We empower people and trust them to do the right thing. Here, you own your work from start to finish, right from day one. PhonePe-rs solve complex problems and execute quickly; often building frameworks from scratch. If you’re excited by the idea of building platforms that touch millions, ideating with some of the best minds in the country and executing on your dreams with purpose and speed, join us!As a Software Engineer:You will build Robust and Scalable web-based applications.Build abstractions and contracts with separation of concerns for a larger scope.Drive problem-solving skills for high-level business and technical problems.Do high-level design with guidance; Functional modeling, break-down of a module.Do incremental changes to architecture: impact analysis of the same.Do performance tuning and improvements in large scale distributed systemsWork closely with Product Manager to derive capability view from features/solutions, Lead execution of medium-sized projectsWork with broader stakeholders to track the impact of projects/features and proactively iterate to improve themAs a Software Engineer, you must have:Extensive and expert programming experience in at least one general programming language (e.g. Java, C, C++) & tech stack to write maintainable, scalable, unit-tested code.Experience with multi-threading and concurrency programming.Experience in building highly scalable business applications, which involve implementing large complex business flows and dealing with a huge amount of data.Extensive experience in object-oriented design skills, knowledge of design patterns, and huge passion and ability to design intuitive module and class-level interfaces.Excellent coding skills – should be able to convert the design into code fluently.Knowledge of Test Driven Development.Good understanding of databases (e.g. MySQL) and NoSQL (e.g. HBase, Elasticsearch, Aerospike, etc).Experience with full life cycle development in any programming language.Worked in a startups environment with high levels of ownership and commitment.BTech, MTech, or Ph.D. in Computer Science or related technical discipline (or equivalent).3-5 years of experience in the art of writing code and solving problems on a Large Scale.PhonePe Full Time Employee Benefits (Not applicable for Intern or Contract Roles)Insurance Benefits - Medical Insurance, Critical Illness Insurance, Accidental Insurance, Life InsuranceWellness Program - Employee Assistance Program, Onsite Medical Center, Emergency Support SystemParental Support - Maternity Benefit, Paternity Benefit Program, Adoption Assistance Program, Day-care Support ProgramMobility Benefits - Relocation benefits, Transfer Support Policy, Travel PolicyRetirement Benefits - Employee PF Contribution, Flexible PF Contribution, Gratuity, NPS, Leave Encashment Other Benefits - Higher Education Assistance, Car Lease, Salary Advance PolicyOur inclusive culture promotes individual expression, creativity, innovation, and achievement and in turn helps us better understand and serve our customers. We see ourselves as a place for intellectual curiosity, ideas and debates, where diverse perspectives lead to deeper understanding and better quality results. PhonePe is an equal opportunity employer and is committed to treating all its employees and job applicants equally; regardless of gender, sexual preference, religion, race, color or disability. If you have a disability or special need that requires assistance or reasonable accommodation, during the application and hiring process, including support for the interview or onboarding process, please fill out this form.Read more about PhonePe on our blog.Life at PhonePePhonePe in the news\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "level": "Associate"
    },
    {
        "company": "Deloitte",
        "job-title": "Frontend Developer",
        "description": "Your potential, unleashed.India’s impact on the global economy has increased at an exponential rate and Deloitte presents an opportunity to unleash and realise your potential amongst cutting edge leaders, and organisations shaping the future of the region, and indeed, the world beyond.At Deloitte, your whole self to work, every day. Combine that with our drive to propel with purpose and you have the perfect playground to collaborate, innovate, grow, and make an impact that matters.The teamThe Digital Excellence Centre is responsible for building products and platforms for Deloitte India that focuses on providing extraordinary customer experience by putting design thinking with trailblazing technology in the center of what they do. The diverse team consists of subject matter experts, technology specialists, quality engineers, user experience researchers & designers, data scientists and product managersYour work profileAs a Sr. Executive/Assistant Manager in our DEC Team you’ll build and nurture positive working relationships with teams and clients with the intention to exceed client expectations: -Responsibilities:Building reusable components and front-end libraries for future use.Translating design wireframes into high quality code.Ability to demonstrate proficiency in Responsive Design & Accessibility.Optimizing components for maximum performance on cross web platforms.Collaboration with UI/UX designers to design, develop, test & deploy solutions based on industry best practices & implementing new UX solutions.Build solutions, resolve design glitches & implement scalable solutions.As a prospective candidate, you should possess:1. 2-4 years of experience on React3. Exposure to popular ReactJS workflows such as Redux / Flux.4. Proficient with JavaScript/TypeScript and SASS/SCSS.5. Deep understanding of HTML DOM objects, CSS manipulations, Restful APIs.6. Proficient knowledge of code versioning tools such as GIT & CI/CD.7. Familiarity with MySQL, Node JS, API design & architecture.Hands-on experience with DevOps, AWS/Google Cloud/Azure.Desired qualificationsGraduationLocation and way of workingBase location: BangaloreThis profile does not involve extensive travel for work.Hybrid is our default way of working. Each domain has customised the hybrid approach to their unique needs.Your role as a Sr. Executive/AMWe expect our people to embrace and live our purpose by challenging themselves to identify issues that are most important for our clients, our people, and for society.In addition to living our purpose, Senior Executive/AM across our organization must strive to be:Inspiring - Leading with integrity to build inclusion and motivationCommitted to creating purpose - Creating a sense of vision and purposeAgile - Achieving high-quality results through collaboration and Team unitySkilled at building diverse capability - Developing diverse capabilities for the futurePersuasive / Influencing - Persuading and influencing stakeholdersCollaborating - Partnering to build new solutionsDelivering value - Showing commercial acumenCommitted to expanding business - Leveraging new business opportunitiesAnalytical Acumen - Leveraging data to recommend impactful approach and solutions through the power of analysis and visualizationEffective communication – Must be well abled to have well-structured and well-articulated conversations to achieve win-win possibilitiesEngagement Management / Delivery Excellence - Effectively managing engagement(s) to ensure timely and proactive execution as well as course correction forthe success of engagement(s)Managing change - Responding to changing environment with resilienceManaging Quality & Risk - Delivering high quality results and mitigating risks with utmost integrity and precisionStrategic Thinking & Problem Solving - Applying strategic mindset to solve business issues and complex problemsTech Savvy - Leveraging ethical technology practices to deliver high impact for clients and for DeloitteEmpathetic leadership and inclusivity - creating a safe and thriving environment where everyone's valued for who they are, use empathy to understand others to adapt our behaviours and attitudes to become more inclusive.How you’ll growConnect for impactOur exceptional team of professionals across the globe are solving some of the world’s most complex business problems, as well as directly supporting our communities, the planet, and each other. Know more in our Global Impact Report and our India Impact Report.Empower to leadYou can be a leader irrespective of your career level. Our colleagues are characterised by their ability to inspire, support, and provide opportunities for people to deliver their best and grow both as professionals and human beings. Know more about Deloitte and our One Young World partnership.Inclusion for allAt Deloitte, people are valued and respected for who they are and are trusted to add value to their clients, teams and communities in a way that reflects their own unique capabilities. Know more about everyday steps that you can take to be more inclusive. At Deloitte, we believe in the unique skills, attitude and potential each and every one of us brings to the table to make an impact that matters.Drive your careerAt Deloitte, you are encouraged to take ownership of your career. We recognise there is no one size fits all career path, and global, cross-business mobility and up / re-skilling are all within the range of possibilities to shape a unique and fulfilling career. Know more about Life at Deloitte.Everyone’s welcome… entrust your happiness to us Our workspaces and initiatives are geared towards your 360-degree happiness. This includes specific needs you may have in terms of accessibility, flexibility, safety and security, and caregiving. Here’s a glimpse of things that are in store for you.Interview tipsWe want job seekers exploring opportunities at Deloitte to feel prepared, confident and comfortable. To help you with your interview, we suggest that you do your research, know some background about the organisation and the business area you’re applying to. Check out recruiting tips from Deloitte professionals.do. The diverse team consists of subject matter experts, technology specialists, quality engineers, user experience researchers & designers, data scientists and product managers\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "level": "Associate"
    },
    {
        "company": "Deloitte",
        "job-title": "Full Stack Developer",
        "description": "Your potential, unleashed.India’s impact on the global economy has increased at an exponential rate and Deloitte presents an opportunity to unleash and realise your potential amongst cutting edge leaders, and organisations shaping the future of the region, and indeed, the world beyond.At Deloitte, your whole self to work, every day. Combine that with our drive to propel with purpose and you have the perfect playground to collaborate, innovate, grow, and make an impact that matters.The teamThe Digital Excellence Centre is responsible for building products and platforms for Deloitte India that focuses on providing extraordinary customer experience by putting design thinking with trailblazing technology in the center of what they do. The diverse team consists of subject matter experts, technology specialists, quality engineers, user experience researchers & designers, data scientists and product managers.Your work profileAs a Senior Executive in our Digital Excellence Center Team you’ll build and nurture positive working relationships with teams and clients with the intention to exceed client expectations: -The ideal candidate will be part of the Digital excellence team in Deloitte, which builds Assets for various stakeholders.Responsibilities:Front-End Development:Develop and maintain responsive and interactive user interfaces using JavaScript frameworks (React, Angular, or Vue.js).Write clean, efficient, and reusable code.Implement UI/UX design mockups into functional web pages.Back-End Development:Develop and maintain server-side logic and integrate with front-end components.Write high-quality, maintainable, and scalable code using Node.js and related technologies.Design and implement RESTful APIs.Database Management:Design and manage databases using SQL and NoSQL technologies.Optimize database queries for performance and scalability.Version Control:Use Git for version control and collaborate with other developers.Participate in code reviews and provide constructive feedback.Testing and Debugging:Write unit tests and integration tests to ensure code quality.Debug and troubleshoot issues in both front-end and back-end components.Continuous Integration/Continuous Deployment (CI/CD):Implement CI/CD pipelines to automate testing and deployment processes.Ensure smooth and efficient deployment of applications.Collaboration:Work closely with cross-functional teams, including designers, product managers, and back-end developers.Participate in team meetings and contribute to project planning and execution.Desired qualifications:Bachelor's degree in Computer Science, Software Engineering, or a related field.Advanced degree preferred but not requiredLocation and way of working:Base location: BangaloreThis profile does not involve extensive travel for work.Hybrid is our default way of working. Each domain has customised the hybrid approach to their unique needs.Your role as a Senior ExecutiveWe expect our people to embrace and live our purpose by challenging themselves to identify issues that are most important for our clients, our people, and for society.In addition to living our purpose, AM across our organization must strive to be:Inspiring - Leading with integrity to build inclusion and motivationCommitted to creating purpose - Creating a sense of vision and purposeAgile - Achieving high-quality results through collaboration and Team unitySkilled at building diverse capability - Developing diverse capabilities for the futurePersuasive / Influencing - Persuading and influencing stakeholdersCollaborating - Partnering to build new solutionsDelivering value - Showing commercial acumenCommitted to expanding business - Leveraging new business opportunitiesAnalytical Acumen - Leveraging data to recommend impactful approach and solutions through the power of analysis and visualizationEffective communication – Must be well abled to have well-structured and well-articulated conversations to achieve win-win possibilitiesEngagement Management / Delivery Excellence - Effectively managing engagement(s) to ensure timely and proactive execution as well as course correction for the success of engagement(s)Managing change - Responding to changing environment with resilienceManaging Quality & Risk - Delivering high quality results and mitigating risks with utmost integrity and precisionStrategic Thinking & Problem Solving - Applying strategic mindset to solve business issues and complex problemsTech Savvy - Leveraging ethical technology practices to deliver high impact for clients and for DeloitteEmpathetic leadership and inclusivity - creating a safe and thriving environment where everyone's valued for who they are, use empathy to understand others to adapt our behaviours and attitudes to become more inclusive.How you’ll growConnect for impactOur exceptional team of professionals across the globe are solving some of the world’s most complex business problems, as well as directly supporting our communities, the planet, and each other. Know more in our Global Impact Report and our India Impact Report.Empower to leadYou can be a leader irrespective of your career level. Our colleagues are characterised by their ability to inspire, support, and provide opportunities for people to deliver their best and grow both as professionals and human beings. Know more about Deloitte and our One Young World partnership.Inclusion for allAt Deloitte, people are valued and respected for who they are and are trusted to add value to their clients, teams and communities in a way that reflects their own unique capabilities. Know more about everyday steps that you can take to be more inclusive. At Deloitte, we believe in the unique skills, attitude and potential each and every one of us brings to the table to make an impact that matters.Drive your careerAt Deloitte, you are encouraged to take ownership of your career. We recognise there is no one size fits all career path, and global, cross-business mobility and up / re-skilling are all within the range of possibilities to shape a unique and fulfilling career. Know more about Life at Deloitte.Everyone’s welcome… entrust your happiness to us Our workspaces and initiatives are geared towards your 360-degree happiness. This includes specific needs you may have in terms of accessibility, flexibility, safety and security, and caregiving. Here’s a glimpse of things that are in store for you.\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "level": "Mid-Senior level"
    },
    {
        "company": "Jar",
        "job-title": "SDE 2 - Backend",
        "description": "About Us Jar is India’s leading Daily Saving app that helps people build strong saving habits—one small step at a time. Our goal is to make saving simple, rewarding, and truly life-changing. Founded in 2021 by Misbah Ashraf and Nishchay AG, Jar is a Bengaluru-based startup with one simple belief: saving a little every day in 24K Digital Gold can truly transform your future. Today, 20 million+ Indians trust Jar as their saving partner. With flexible saving options—Daily, Weekly, Monthly, and Instant Saving—we have made it easy for everyone to save in their own way and withdraw anytime. We are one of the leaders in UPI autopay transactions, crossing more than 1 million transactions per day. In 2023, we expanded our vision with Nek, our jewelry brand crafted to bring together luxury and affordability, it has since surpassed ₹100 crore in revenue.  We have a big dream of bringing “Har Ghar Sona”. Small, consistent savings are just the start. We’re here to walk alongside our users, helping Indians secure their financial future every step of the way. Backed by Tiger Global Management, Arkam Ventures, and WEH Ventures, among others, we have raised $50 million+ in funding. In January 2025, we hit a huge milestone of becoming profitable. Now, we’re charging ahead, focused on sustainable growth and scaling impact.And this is just the beginning! What's the role?We are seeking a highly motivated and experienced Backend SDE-2 Engineer to join our dynamic team. In this role, you will be instrumental in designing, developing, and maintaining robust and scalable backend systems that power our innovative products. You will have the opportunity to work on challenging problems, contribute to architectural decisions, and mentor junior engineers, all while focusing on delivering exceptional user experiences. What will be your responsibilities? Design and Development:Lead the design and development of highly scalable, available, and fault-tolerant API-based applications, keeping platform reusability in mind.Translate complex business problem statements into technical solutions, leveraging your expertise in backend system design.Actively participate in creating High-Level Designs (HLD) and Low-Level Designs (LLDs) for software development, ensuring alignment with architectural best practices.Select appropriate frameworks, libraries, and network stacks based on data-driven decision-making to optimize performance and efficiency. Technical Excellence & Ownership:Write clean, modular, well-documented, and reusable code with a strong emphasis on good hygiene (naming, structure, etc.).Conduct performance tuning and implement improvements in large-scale distributed systems.Take end-to-end ownership of product delivery, ensuring high scalability and reliability.Proactively identify and resolve bugs and production issues with a sense of urgency, actively participating in Root Cause Analysis (RCA) exercises. Collaboration & Mentorship:Break down larger or ambiguous problems into smaller, manageable tasks to bring predictability to overall execution.Actively participate in code reviews, providing constructive feedback on both functional and non-functional aspects (e.g., performance, security, maintainability).Mentor junior engineers, fostering a collaborative team spirit and contributing to their professional growth.Collaborate effectively with cross-functional teams, demonstrating strong communication skills to align on requirements and deliver integrated solutions What’s required from you? B.Tech, M.Tech, or Ph.D. in Computer Science or a related technical discipline (or equivalent practical experience).Strong understanding of Computer Science fundamentals, including data structures, algorithms, operating systems, and computer networks.3-5 years of hands-on experience in backend development, with significant expertise in server-side technologies such as Java/Spring Boot.Proven experience building and scaling applications on public cloud infrastructure (e.g., AWS, GCP, Azure), utilizing technologies like Docker and Kubernetes.Proficiency in working with various database systems, including both relational (e.g., PostgreSQL) and NoSQL (e.g., MongoDB, Elasticsearch) databases.Experience building products for highly consistent use cases is a strong plus.A go-getter attitude with a strong intent and energy to solve complex technical challenges.What makes us different? We’re not just building a product—we’re shaping the future of savings in India. We seek people who bring passion, energy, and fresh ideas to help us make that happen. Experience matters, but we are a potential first organisation. We move fast, learn from our mistakes, and take bold risks to solve problems that haven’t been attempted before. If you’re excited about working in an environment where people inspire and truly support each other, you’ve found the right fit. What do we stand for?  The five values that we live by: Passion: At Jar, we strive to create an environment where people love what they do, are motivated and equipped to do their best work. Equality: We bring diverse skills, ideas, and experiences to the table, supporting and challenging each other across teams to create something bigger than ourselves. Growth: When our people grow, Jar grows. We create opportunities for learning, development, and meaningful impact. Accountability: The core of our work ethic is taking ownership of our work, showing initiative, and having the freedom to ask questions. Consistency: We believe in doing the right things consistently. Big change doesn’t happen overnight, it’s built one step at a time. Join us and let’s build something amazing together!   What employee benefits do we have? Glad you asked! Among other things, we have Medical Insurance for employees and their familiesESOPs allocationPluxee meal cardSwish club card for exclusive employee discounts Advance salary plansRelocation assistanceL&D programmes \n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "level": "Entry level"
    },
    {
        "company": "MakeMyTrip",
        "job-title": "Python Developer",
        "description": "At MakeMyTrip (MMT), technology is at the heart of everything we do. As a leading player in the travel industry, we leverage cutting-edge solutions like AI, machine learning, and cloud infrastructure to create seamless and innovative travel experiences. We prioritize a tech-first mindset, where our engineering teams lead the charge in transforming the way people travel.Our culture encourages collaboration, creativity, and thought leadership, empowering engineers to challenge the status quo and develop impactful, game-changing solutions. At MMT, you'll work with the latest technologies, continually push boundaries, and have the chance to shape the future of travel.Job Title: Senior Software Engineer I/IILocation: BangaloreExperience Level: 3-6 yearsWhat you’ll be doing:· Low level Design and coding to develop backend systems using Python (on Django framework), ensuring high performance, scalability, and security. Write clean, efficient, and well-documented code.· Very good understanding of Data structure, design patterns and async flow. Build and maintain microservices-based applications, optimizing and refactoring them to improve performance and functionality.· Provide technical insights and share knowledge with team members to solve complex challenges.· Work with relational and SQL and NoSQL databases (e.g., MySQL, MongoDB, Cassandra) to design, query, and optimize database schemas and queries for high-availability applications.What you’ll bring to the table:· Expert-level knowledge of Python and a proven track record of designing and building large-scale, high-availability systems.· Deep expertise in Agile methodologies and collaborating with cross functional teams to deliver high-impact products.· A strong understanding of design principles, and a passion for creating elegant, scalable solutions.· Strong experience working in product/start-up environments, where high innovation is key to success.Why Explore a Career at MMT?At MakeMyTrip, we are redefining the travel industry with innovation and customer-first solutions. As an SDE at MMT, you’ll have the unique opportunity to work on cutting-edge technologies and solve complex challenges that directly impact millions of travelers. Our dynamic and inclusive culture fosters creativity, continuous learning, and career growth, ensuring that every team member thrives. With a strong emphasis on collaboration, work-life balance, and personal development, MMT is more than just a workplace—it’s a place to build your future while making a difference.What Makes Us Awesome?At MMT, we don’t just build software, we create experiences that redefine how people travel. Our passion for innovation, customer-centric mindset, and technology-driven approach set us apart in the industry. With a leadership team that values empowerment and a collaborative environment that encourages bold ideas, you’ll be part of a forward-thinking team committed to transforming the travel experience. Join us, and let’s shape the future of travel together.\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "level": "Mid-Senior level"
    },
    {
        "company": "Licious",
        "job-title": "SDE 1",
        "description": "Licious was launched in September 2015 by Abhay Hanjura and Vivek Gupta who sensed a huge business opportunity in offering prime quality meat products that was otherwise dominated by the unhygienic and unreliable wet market followed by frozen meat options which is an unpopular workaround for Indian consumers. Licious follows an end-to-end business based on the hub and spoke model that starts from procuring the fresh produce to processing, storage and delivery.Through this entire supply chain, the freshness and nutritional content of the meat is strictly maintained till the delivery at the doorstep of the consumer. Licious was started with the aim of satisfying customers with world class meat, fish, seafood and meat based products. Powered by technology, Licious delivers within 120 minutes of ordering through either the web site or the Licious app.Required technical skills:● Bachelor's Degree in Computer Science or similar discipline/B.E from reputedcolleges.● 1-3 years of development experience in fast phased startups as developer● Should be proficient in Java or related frameworks.● Good knowledge on frontend technologies (HTML, JS, CSS and ReactJs) - good to have● Good problem-solving skills and self-motivated.● Thrives in agile environments but also understands the balance in coding disciplinerequired for large scale, high quality, end consumer apps.● Comfort and experience working with API development.● Experience in both jumping into an existing architecture and starting projects fromscratch.● Proven ability to take initiative and dive into new areas of technology.● Passion for learning, analysing technology trade-offs and shipping products.● Full stack experience is a plus● Comfortable with SQL, NOSQL databases● Knowledge on AWS deployments is a plus● Good logical thinking with fundamentally strongRoles:● Actively participate and contribute to all aspects of the software development lifecycleincluding: brainstorm, architecture, design and technical tradeoffs and prioritization,implementation, quality assurance, and delivery for features slated for both our existingplatform and new services.● Continuously deliver rapid and consistent software and services that delight and engageour customers in tight collaboration with Product Managers and other members of theteam.● Improve our development processes and code quality, keeping us up-to-date with thelatest industry trends.● Taking initiative and ownership to complete given project\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "level": "Associate"
    },
    {
        "company": "Flipkart",
        "job-title": "Software Engineer",
        "description": "About FlipkartFlipkart is India’s largest e-commerce marketplace with a registered customer base of over 100 million. In the 10 years since it started, Flipkart has come to offer over 80 million products across 80+ categories including Smartphones, Books, Media, Consumer Electronics, Furniture, Fashion and Lifestyle. Launched in October 2007, Flipkart is known for its path-breaking services like Cash on Delivery, No cost EMI and a 10-day replacement policy. Flipkart was the pioneer in offering services like In-a-Day Guarantee (65 cities) and Same-Day-Guarantee (13 cities) at scale. With over 1,00,000 registered sellers, Flipkart has redefined the way brands and MSME’s do business online.The RoleThe Software Development Engineer's core responsibilities include working on highly-maintainable and unit tested software components/system that address real world problems. You will be working in a fast paced and agile work environment delivering quality solutions that have immediate business impact.You (Must Have)• Minimum 0.6 year of experience and Less than 2 years of experience• Strong problem solving skills• Good understanding of data structures & algorithms and their space & time complexities• Strong hands-on and practical working experience with at least one programming language:• C/Java/C++• Excellent coding skills – should be able to convert design into code fluently• Strong technical aptitude and a good knowledge of CS fundamentals• Hands-on experience working with Databases and Linux platform is a plus• B Tech in Computer Science or equivalent from a reputed collegeYour Array (Nice to Haves):You will assume complete ownership of the projects you deliver while collaborating with technical and non-technical stakeholders on all elements of the development process. You are expected to demonstrate good learnability and adopt technologies that help build large scale, performant, reliable and sustainable systems.\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "level": "Entry level"
    },
    {
        "company": "Infosys",
        "job-title": "React JS Developer",
        "description": "Technology->Media->Settop Box, DVB,Technology->Media->Video Streaming,Technology->Reactive Programming->react JSA day in the life of an Infoscion As part of the Infosys consulting team, your primary role would be to lead the engagement effort of providing high-quality and value-adding consulting solutions to customers at different stages- from problem definition to diagnosis to solution design, development and deployment. You will review the proposals prepared by consultants, provide guidance, and analyze the solutions defined for the client business problems to identify any potential risks and issues. You will identify change Management requirements and propose a structured approach to client for managing the change using multiple communication mechanisms. You will also coach and create a vision for the team, provide subject matter training for your focus areas, motivate and inspire team members through effective and timely feedback and recognition for high performance. You would be a key contributor in unit-level and organizational initiatives with an objective of providing high-quality, value-adding consulting solutions to customers adhering to the guidelines and processes of the organization. If you think you fit right in to help our clients navigate their next in their digital transformation journey, this is the place for you! Good knowledge on software configuration management systems Strong business acumen, strategy and cross-industry thought leadership Awareness of latest technologies and Industry trends Logical thinking and problem solving skills along with an ability to collaborate Two or three industry domain knowledge Understanding of the financial processes for various types of projects and the various pricing models available Client Interfacing skills Knowledge of SDLC and agile methodologies Project and Team management\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "level": "Entry level"
    },
    {
        "company": "SFO Technologies",
        "job-title": "Web Application Engineers",
        "description": "SFO Technologies (http://www.sfotechnologies.net/) is a 25 year old organization with strong presence in communication (fiber optic devices, RF communication systems, STB…), health care (ultrasound scanners, x-ray equipments, nuclear medicine…), transportation (metro fare collection gates, automotive electronics…) and value added engineering services. We serve multiple tier-1 clients - GE, Toshiba, ALSTOM, DIEBOLD, HITACHI, THALES to name a few.Our vision is to be a globally respected leader in transforming the way businesses and people connect and communicate there by helping our clients create and enhance business value by providing world-class technological services & solutions.We build a strong technology core team providing niche skilled solutions/services in the field of SDN/NFV, Internet Of Things involving Big Data Analytics & Enterprise Mobility. Wireless/wireline SDN/NFV with OpenDaylight, OpenStack, DPDK technologies. Connected Devices/Sensors & IoT Gateway Solutions. Enterprise Mobility Solutions. Preventive & predictive analytics using machine learning algorithms. Skills: AngularJS (1.x), J2EE, NodeJS (Node.js) and Spring\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "level": "Entry level"
    },
    {
        "company": "Infosys",
        "job-title": "Python Developer",
        "description": "Python Knowledge of design principles and fundamentals of architecture Understanding of performance engineering Knowledge of quality processes and estimation techniques Basic understanding of project domain Ability to translate functional / nonfunctional requirements to systems requirements Ability to design and code complex programs Ability to write test cases and scenarios based on the specifications Good understanding of SDLC and agile methodologies Awareness of latest technologies and trends Logical thinking and problem solving skills along with an ability to collaborate\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "level": "Entry level"
    },
    {
        "company": "In Time Tec",
        "job-title": "Python Developer",
        "description": "In Time Tec is an award-winning IT & software company. In Time Tec offers progressive software development services, enabling its clients to keep their brightest and most valuable talent focused on innovation. In Time Tec has a leadership team averaging 15 years in software/firmware R&D, and 20 years building onshore/offshore R&D teams. We are looking for rare talent to join us. People having a positive mindset and great organizational skills will be drawn to the position. Your capacity to take initiative and solve problems as they emerge, flexibility, and honesty, will be key factors for your success at In Time Tec. Job OverviewThe position requires an experienced and ambitious candidate who is passionate about technology and self-driven. We have an energetic workplace where we welcome innovative ideas and offer growth opportunities and a positive environment for accomplishing goals. Our purpose is to create abundance for everyone we touch.Responsibilities Of The Role IncludeExperience on Open-Source Platforms in designing/ developing Web-based applications. Require Strong knowledge in Python with application/package/module development, tuning, and debugging tools. Proficient understanding of Python Identifiers, Reserved Words, Basic Operators, Variable Types, and User defined exception handling with their usage. In-depth knowledge of Python Dictionary and default modules included in Python (String, Date Time, Numbers, and other required functions usage). Proficient understanding of Sequences and their differences (Tuples/Lists). File manipulation-using Python (Create, Edit, and Delete view file). Ability to organize code logically and with the understandable procedure that is well defined, documented, and testable. Strong understanding of OOPS and Design Patterns (Code design skills in Python-based object-oriented programming and functional programming). Developing Web Applications with Python - Hands on experience using MVC frameworks like Django. Exposure to Code Versioning Systems such as Atlassian Bitbucket. In-depth Knowledge in JavaScript and jQuery. The candidate must display excellent written and verbal skills with demonstrated interpersonal and organizational abilities. Education RequiredCandidates with B.Tech or M.Tech degree are preferred. How You’ll Grow At In Time TecIn Time Tec, has made significant investments to create a stimulating environment for its people to grow. We want each of our employees to grow in their way and play their roles while honing their ownership abilities. As part of those efforts, we provide our professionals with a range of educational opportunities to help them grow in their career.Our guiding principles of leadership, trust, transparency, and integrity serve as the foundation for everything we do and every success we achieve. We are proud of these fundamental principles since they demonstrate our dedication towards them as a “One Team”. We value every individual by giving them the freedom to make daily decisions that can support their health, well-being, confidence, and awareness. Our leadership team is there to offer the safe base by giving the right budding environment, instruction, tools, and chances necessary for your professional development in achieving your goals.Our people and culture work together in a collaborative environment, making In Time Tec a thriving place to work. You can find out more about Life at In Time Tec here.\n        \n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "level": "Entry level"
    },
    {
        "company": "Capco",
        "job-title": "Frontend Developer",
        "description": "About Us“Capco, a Wipro company, is a global technology and management consulting firm. Awarded with Consultancy of the year in the British Bank Award and has been ranked Top 100 Best Companies for Women in India 2022 by Avtar & Seramount. With our presence across 32 cities across globe, we support 100+ clients across banking, financial and Energy sectors. We are recognized for our deep transformation execution and delivery. WHY JOIN CAPCO?You will work on engaging projects with the largest international and local banks, insurance companies, payment service providers and other key players in the industry. The projects that will transform the financial services industry.MAKE AN IMPACTInnovative thinking, delivery excellence and thought leadership to help our clients transform their business. Together with our clients and industry partners, we deliver disruptive work that is changing energy and financial services.#BEYOURSELFATWORKCapco has a tolerant, open culture that values diversity, inclusivity, and creativity.CAREER ADVANCEMENTWith no forced hierarchy at Capco, everyone has the opportunity to grow as we grow, taking their career into their own hands.DIVERSITY & INCLUSIONWe believe that diversity of people and perspective gives us a competitive advantage.Job Title: Frontend DeveloperJob Requirements:Work location: BengaluruWorking Hours: 12:30 PM – 9:30 PM ISTRole DescriptionShould be primarily experienced in backend development and should be able to design, create, and implement a solution that is domain-driven, abstracted, business-oriented, and scalable from scratch, while also able to debug & fix issues.• Core Skills:Hard Skills:• C#/.NET (Primary), Azure Functions, T-SQL/SQL Server (inline SQL), REST APIs, Dependency Injection, OpenAPI documentation.Nice to have:• JWT, Azure APIM, Azure Data Factory, Azure Service Bus, Redis Caching, CI/CD YAML, Advanced GitCompetencies:• API Development: Strong ability to build clean, well-documented, and secure REST APIs that adhere to our architectural standards.• Database Interaction: Proficient in writing performant SQL queries and managing database schemas.• Quality First: A commitment to writing unit and integration tests as part of their daily workflow, using frameworks like xUnit and/or NUnit.• Reliability: Focuses on building reliable services with robust error handling, logging, and monitoring.If you are keen to join us, you will be part of an organization that values your contributions, recognizes your potential, and provides ample opportunities for growth. For more information, visit www.capco.com. Follow us on Twitter, Facebook, LinkedIn, and YouTube.\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "level": "Mid-Senior level"
    },
    {
        "company": "Infosys",
        "job-title": "Java Developer",
        "description": "Primary skills:Technology->Database->SQL tuning,Technology->Java->Core Java,Technology->Java->Java - ALL,Technology->Java->Spring MVC,Technology->Java->SpringbootA day in the life of an Infoscion As part of the Infosys delivery team, your primary role would be to interface with the client for quality assurance, issue resolution and ensuring high customer satisfaction. You will understand requirements, create and review designs, validate the architecture and ensure high levels of service offerings to clients in the technology domain. You will participate in project estimation, provide inputs for solution delivery, conduct technical risk planning, perform code reviews and unit test plan reviews. You will lead and guide your teams towards developing optimized high quality code deliverables, continual knowledge management and adherence to the organizational guidelines and processes. You would be a key contributor to building efficient programs/ systems and if you think you fit right in to help our clients navigate their next in their digital transformation journey, this is the place for you! If you think you fit right in to help our clients navigate their next in their digital transformation journey, this is the place for you! Knowledge of more than one technology Basics of Architecture and Design fundamentals Knowledge of Testing tools Knowledge of agile methodologies Understanding of Project life cycle activities on development and maintenance projects Understanding of one or more Estimation methodologies, Knowledge of Quality processes Basics of business domain to understand the business requirements Analytical abilities, Strong Technical Skills, Good communication skills Good understanding of the technology and domain Ability to demonstrate a sound understanding of software quality assurance principles, SOLID design principles and modelling methods Awareness of latest technologies and trends Excellent problem solving, analytical and debugging skills\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "level": "Entry level"
    },
    {
        "company": "Infosys",
        "job-title": "Python Developer",
        "description": "Python development experience 2. Working experience on Linux 3. Basic cable/networking knowledge 4. Good debugging skills on Linux environmentA day in the life of an Infoscion As part of the Infosys delivery team, your primary role would be to provide best fit architectural solutions for one or more projects. You would also provide technology consultation and assist in defining scope and sizing of work You would implement solutions, create technology differentiation and leverage partner technologies. Additionally, you would participate in competency development with the objective of ensuring the best-fit and high quality technical solutions. You would be a key contributor in creating thought leadership within the area of technology specialization and in compliance with guidelines, policies and norms of Infosys. If you think you fit right in to help our clients navigate their next in their digital transformation journey, this is the place for you! Knowledge of architectural design patterns, performance tuning, database and functional designs Hands-on experience in Service Oriented Architecture Ability to lead solution development and delivery for the design solutions Experience in designing high level and low level documents is a plus Good understanding of SDLC is a pre-requisite Awareness of latest technologies and trends Logical thinking and problem solving skills along with an ability to collaborate\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "level": "Entry level"
    },
    {
        "company": "Infosys",
        "job-title": "Java Developer",
        "description": "Primary skills:Technology->Java->Java - ALLA day in the life of an Infoscion As part of the Infosys delivery team, your primary role would be to ensure effective Design, Development, Validation and Support activities, to assure that our clients are satisfied with the high levels of service in the technology domain. You will gather the requirements and specifications to understand the client requirements in a detailed manner and translate the same into system requirements. You will play a key role in the overall estimation of work requirements to provide the right information on project estimations to Technology Leads and Project Managers. You would be a key contributor to building efficient programs/ systems and if you think you fit right in to help our clients navigate their next in their digital transformation journey, this is the place for you! If you think you fit right in to help our clients navigate their next in their digital transformation journey, this is the place for you! Knowledge of design principles and fundamentals of architecture Understanding of performance engineering Knowledge of quality processes and estimation techniques Basic understanding of project domain Ability to translate functional / nonfunctional requirements to systems requirements Ability to design and code complex programs Ability to write test cases and scenarios based on the specifications Good understanding of SDLC and agile methodologies Awareness of latest technologies and trends Logical thinking and problem solving skills along with an ability to collaborate\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "level": "Entry level"
    },
    {
        "company": "IBM",
        "job-title": "Frontend Developer",
        "description": "IntroductionAbout Business UnitIBM Systems helps IT leaders think differently about their infrastructure. IBM servers and storage are no longer inanimate - they can understand, reason, and learn so our clients can innovate while avoiding IT issues. Our systems power the world’s most important industries and our clients are the architects of the future. Join us to help build our leading-edge technology portfolio designed for cognitive business and optimized for cloud computing.Wonder if IBM is the one for you? :In a world where technology never stands still, we understand that, dedication to our clients success, innovation that matters, and trust and personal responsibility in all our relationships, lives in what we do as IBMers as we strive to be the catalyst that makes the world work better.Being an IBMer means you’ll be able to learn and develop yourself and your career, you’ll be encouraged to be courageous and experiment everyday, all whilst having continuous trust and support in an environment where everyone can thrive whatever their personal or professional background.Our IBMers are growth minded, always staying curious, open to feedback and learning new information and skills to constantly transform themselves and our company. They are trusted to provide on-going feedback to help other IBMers grow, as well as collaborate with colleagues keeping in mind a team focused approach to include different perspectives to drive exceptional outcomes for our customers. The courage our IBMers have to make critical decisions everyday is essential to IBM becoming the catalyst for progress, always embracing challenges with resources they have to hand, a can-do attitude and always striving for an outcome focused approach within everything that they do.Are you ready to be an IBMer?About IBMIBM's greatest invention is the IBMer. We believe that through the application of intelligence, reason and science, we can improve business, society and the human condition, bringing the power of an open hybrid cloud and AI strategy to life for our clients and partners around the world. Restlessly reinventing since 1911, we are not only one of the largest corporate organizations in the world, we’re also one of the biggest technology and consulting employers, with many of the Fortune 50 companies relying on the IBM Cloud to run their business. At IBM, we pride ourselves on being an early adopter of artificial intelligence, quantum computing and blockchain. Now it’s time for you to join us on our journey to being a responsible technology innovator and a force for good in the world.Your Role And Responsibilities Work as an Engineering Professional, on design, development and support of the System, Cloud Management and Infrastructure as a service for IBM Power Servers. Design and develop user centric Graphical User Interface for management solutions in Agile environment. Define and implement high performance software by leveraging a strong understanding of underlying system design Be a contributor in developing an environment of continuous improvement across product lines and development groups Interact with the test team to define test plans and test data; identify reproduce and defects; fix and verify defects.Preferred EducationMaster's DegreeRequired Technical And Professional ExpertiseAn understanding of the software development life cycle for the product with Strong Programming skills3+ years experience in Web development skills in React JS, JavaScript, HTML, CSS , Jest, Puppeteer.Knowledge of Terraform, Python. Knowledge of GraphQL and RESTful web services Experience developing rich HTML applications System Management stack software design & development Cloud Essentials, Stack design and development Strong debug and problem determination skills Knowledge in Servers domain/Cloud architecture Analytical skills, decision-making ability Ability to work in a team, under schedule pressure, and maintain deadlines Excellent communication and presentation skills Candidates should have team-based software development experience, be self-starters, demonstrated communicators, and able to work well with a group of peers.Preferred Technical And Professional Experience Experience on IDE like Visual Code, Atom, Eclipse Experience on tools like Jenkins, Git/Github, Gerrit or other equivalent tools At least 2 years of web development based on React.js, 3+ years on Angular JavaScript Frameworks.\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "level": "Mid-Senior level"
    },
    {
        "company": "Jar",
        "job-title": "SDE 1 - Android",
        "description": "About Us Jar is India’s leading Daily Saving app that helps people build strong saving habits—one small step at a time. Our goal is to make saving simple, rewarding, and truly life-changing. Founded in 2021 by Misbah Ashraf and Nishchay AG, Jar is a Bengaluru-based startup with one simple belief: saving a little every day in 24K Digital Gold can truly transform your future. Today, 20 million+ Indians trust Jar as their saving partner. With flexible saving options—Daily, Weekly, Monthly, and Instant Saving—we have made it easy for everyone to save in their own way and withdraw anytime. We are one of the leaders in UPI autopay transactions, crossing more than 1 million transactions per day. In 2023, we expanded our vision with Nek, our jewelry brand crafted to bring together luxury and affordability, it has since surpassed ₹100 crore in revenue.We have a big dream of bringing “Har Ghar Sona”. Small, consistent savings are just the start. We’re here to walk alongside our users, helping Indians secure their financial future every step of the way.Backed by Tiger Global Management, Arkam Ventures, and WEH Ventures, among others, we have raised $50 million+ in funding. In January 2025, we hit a huge milestone of becoming profitable. Now, we’re charging ahead, focused on sustainable growth and scaling impact.And this is just the beginning!What’s the role?Are you passionate about building exceptional mobile applications? Join our dynamic and fast-paced team as a Full-Time Android Developer, where you’ll work with cutting-edge technologies and contribute to impactful product development. This role offers an exciting opportunity to grow your skills, tackle challenging projects, and collaborate with a team of talented engineers.As part of our team, you’ll write clean, maintainable code, develop meaningful features, and gain hands-on experience with modern tools and best practices in mobile development. Our Tech Stack Kotlin Multiplatform Kotlin Coroutines Dependency Injection: Hilt AndroidX NavGraphKtorA multimodular app with 50+ modules and 700k+ lines of Kotline codeWhat will be your responsibilities? Write clean, maintainable code that follows conventions and incorporates feedback to continually improve quality.Develop and maintain complex features and views with minimal supervision, ensuring performance optimization.Participate in code reviews, contributing to and learning from team best practices.Explore and suggest improvements to the mobile tech stack, implementing changes collaboratively with the team.Monitor feature health using logging tools and ensure thorough manual testing before release.Collaborate effectively with the team, taking ownership of features and driving them to completion.Communicate clearly, providing timely updates on feature progress and ensuring alignment with team goals.What’s required from you? Experience (1-3 years)Strong knowledge of KotlinExperience with Jetpack ComposeUnderstanding of LiveData and FlowsProficient with CoroutinesFamiliarity with MVVM architecture Good-to-Have Skills Experience working on multimodular Android projectsSolid grasp of data structures and algorithmsExposure to Kotlin MultiplatformUnderstanding of Dependency Injection What makes us different? We’re not just building a product—we’re shaping the future of savings in India. We seek people who bring passion, energy, and fresh ideas to help us make that happen. Experience matters, but we are a potential first organisation. We move fast, learn from our mistakes, and take bold risks to solve problems that haven’t been attempted before. If you’re excited about working in an environment where people inspire and truly support each other, you’ve found the right fit. What do we stand for?The five values that we live by:Passion: At Jar, we strive to create an environment where people love what they do, are motivated and equipped to do their best work.Equality: We bring diverse skills, ideas, and experiences to the table, supporting and challenging each other across teams to create something bigger than ourselves.Growth: When our people grow, Jar grows. We create opportunities for learning, development, and meaningful impact.Accountability: The core of our work ethic is taking ownership of our work, showing initiative, and having the freedom to ask questions.Consistency: We believe in doing the right things consistently. Big change doesn’t happen overnight, it’s built one step at a time.Join us and let’s build something amazing together!    What employee benefits do we have?Glad you asked! Among other things, we have Medical Insurance for employees and their familiesESOPs allocationPluxee meal cardSwish club card for exclusive employee discounts Advance salary plansRelocation assistanceL&D programmes \n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "level": "Entry level"
    },
    {
        "company": "Infosys",
        "job-title": "Java Developer",
        "description": "Primary skills:Technology->Cloud Platform->Microservices,Technology->Java->Core Java,Technology->Java->Java - ALL,Technology->Java->Java Documentation,Technology->Java->SpringbootA day in the life of an Infoscion As part of the Infosys delivery team, your primary role would be to interface with the client for quality assurance, issue resolution and ensuring high customer satisfaction. You will understand requirements, create and review designs, validate the architecture and ensure high levels of service offerings to clients in the technology domain. You will participate in project estimation, provide inputs for solution delivery, conduct technical risk planning, perform code reviews and unit test plan reviews. You will lead and guide your teams towards developing optimized high quality code deliverables, continual knowledge management and adherence to the organizational guidelines and processes. You would be a key contributor to building efficient programs/ systems and if you think you fit right in to help our clients navigate their next in their digital transformation journey, this is the place for you! If you think you fit right in to help our clients navigate their next in their digital transformation journey, this is the place for you! Knowledge of more than one technology Basics of Architecture and Design fundamentals Knowledge of Testing tools Knowledge of agile methodologies Understanding of Project life cycle activities on development and maintenance projects Understanding of one or more Estimation methodologies, Knowledge of Quality processes Basics of business domain to understand the business requirements Analytical abilities, Strong Technical Skills, Good communication skills Good understanding of the technology and domain Ability to demonstrate a sound understanding of software quality assurance principles, SOLID design principles and modelling methods Awareness of latest technologies and trends Excellent problem solving, analytical and debugging skills\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "level": "Entry level"
    },
    {
        "company": "Infosys",
        "job-title": "Python developer",
        "description": "Primary skills:Technology->Machine Learning->PythonA day in the life of an Infoscion As part of the Infosys delivery team, your primary role would be to ensure effective Design, Development, Validation and Support activities, to assure that our clients are satisfied with the high levels of service in the technology domain. You will gather the requirements and specifications to understand the client requirements in a detailed manner and translate the same into system requirements. You will play a key role in the overall estimation of work requirements to provide the right information on project estimations to Technology Leads and Project Managers. You would be a key contributor to building efficient programs/ systems and if you think you fit right in to help our clients navigate their next in their digital transformation journey, this is the place for you! If you think you fit right in to help our clients navigate their next in their digital transformation journey, this is the place for you! Knowledge of design principles and fundamentals of architecture Understanding of performance engineering Knowledge of quality processes and estimation techniques Basic understanding of project domain Ability to translate functional / nonfunctional requirements to systems requirements Ability to design and code complex programs Ability to write test cases and scenarios based on the specifications Good understanding of SDLC and agile methodologies Awareness of latest technologies and trends Logical thinking and problem solving skills along with an ability to collaborate\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "level": "Entry level"
    }
]